<?php
// +----------------------------------------------------------------------
// | ThinkPHP 5 [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2019 .
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: thinkmix <thinkmix@163.com>
// +----------------------------------------------------------------------

namespace app\common\enums;

/**
 * 后台系统错误码
 * Class ErrorCode
 * @package app\common\model
 */
class ErrorCode
{

    // +----------------------------------------------------------------------
    // | 系统级错误码
    // +----------------------------------------------------------------------
    const SYSTEM_ERROR = [ 'code' => 500, 'msg' => '系统繁忙，请稍后再试。'];

    // +----------------------------------------------------------------------
    // | 请求级错误码
    // +----------------------------------------------------------------------
    const PARAMS_ERROR = [ 'code' => 201, 'msg' => '参数错误'];
    const USER_LOGIN_EXPIRE = [ 'code' => 202, 'msg' => '登录失效'];
    const USER_LOGIN_FAILED = [ 'code' => 203, 'msg' => '用户名或者密码错误'];
    const USER_POWER_FAILED = [ 'code' => 204, 'msg' => '权限验证失败'];
    // +----------------------------------------------------------------------
    // | 逻辑级错误码
    // +----------------------------------------------------------------------
    const USER_REGISTER_FAILED = [ 'code' => 301, 'msg' => '注册失败'];
    const USER_REGISTER_EXIST = [ 'code' => 302, 'msg' => '账户已被注册'];
    const USER_MODIFY_FAILED = [ 'code' => 303, 'msg' => '用户信息修改失败'];
    const USER_PWD_ERROR = [ 'code' => 303, 'msg' => '密码校验错误'];
}
